Revit 2027 API
SurfaceNdfType Enumeration
 The enumerated type representing the permitted values for the asset property "SurfaceNdfType" from the "AdvancedLayered" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SurfaceNdfType
Public Enumeration SurfaceNdfType
public enum class SurfaceNdfType
type SurfaceNdfType
Members
Member name | Value | Description
Beckmann | 0
Ggx | 1
See Also
Reference
Autodesk.Revit.DB.Visual Namespace